function [alpha,aa,signals_f, filt_signals] = absorbation_sound_speed(Fsamp, T, S, Z, r, FkHz, PLorenz, SprottA, SprottB, SprottC, SprottE, Four_wing, CHIR, LFM2, SWL2, coss)
%%%Изменение скорости звука (профили) и затухание (поглощение)%%%%%%%%%%%%%%%%%%Расчет поглощения: Фишера - Симмонса
% clear all
%%Метод 1 Params
phi = 45; %широта в градусах

%%Метод 2 Params
p = 0.986923*Z*100; %в барах: 1 Бар = 0,986923 атмосферы, так как z в км
t = T;
s = S;

Z1 = Z*(1-0.0026*cos(2*pi/180*phi));
DZ = 16.3.*Z1 + 0.018.*Z1.^2;

%%%Простая формула
C = 1449.05 + T.*(4.57 - T.*(0.0521 - 0.00023.*T)) + (1.333 - T.*(0.0126 - 0.00009.*T))*(S-35) + DZ;
% plot(C,Z)
% grid on

%%%Модель Чена-Миллеро
a_0 = 1.389 - 1.262*10^(-2).*t + 7.164*10^(-5).*t.^2 + 2.006*10^(-6).*t.^3 - 3.21*10^(-8).*t.^4;
a_1 = 9.4742*10^(-5) - 1.258*10^(-5).*t - 6.4885*10^(-8).*t.^2 + 1.0507*10^(-8).*t.^3 - 2.0122*10^(-10).*t.^4;
a_2 = -3.9064*10^(-7) + 9.1041*10^(-9).*t - 1.6002*10^(-10).*t.^2 + 7.988*10^(-12).*t.^3;
a_3 = 1.1*10^(-10) + 6.649*10^(-12).*t - 3.389*10^(-13).*t.^2;
a = a_0 + p.*a_1 + p.^2.*a_2 + p.^3.*a_3;

b_0 = -1.922*10^(-2) - 4.42*10^(-5).*t;
b_1 = 7.3637*10^(-5) + 1.7945*10^(-7).*t;
b = b_0 + b_1.*p;

c_0 = 1402.388 + 5.03711.*t - 5.80852*10^(-2).*t.^2 + 3.342*10^(-4).*t.^3 - 1.478*10^(-6).*t.^4 + 3.1464*10^(-9).*t.^5;
c_1 = 0.153563 + 6.8982*10^(-4).*t - 8.1788*10^(-6).*t.^2 + 1.3621*10^(-7).*t.^3 + 6.1185*10^(-10).*t.^4;
c_2 = 3.126*10^(-5) - 1.7107*10^(-6).*t + 2.5974*10^(-8).*t.^2 - 2.5335*10^(-10).*t.^3 + 1.0405*10^(-12).*t.^4;
c_3 = -9.7729*10^(-9) + 3.8504*10^(-10).*t - 2.3643*10^(-12).*t.^2;
c = c_0 + p.*c_1 + p.^2.*c_2 + p.^3.*c_3;

d = 1.727*10^(-3) - 7.8936*10^(-6).*p;

%скорость звука в итоге
c_s = c + a.*s + b.*s.^(3/2) + d.*s.^2;


%%%%%%%%%%%%%%%%%% Расчет поглощения: Фишера - Симмонса %%%%%%%%%%%%%%%%%%
%Параметры системы
%alpha - коэффициент поглощения в дБ/км
%c - скорость звука в воде м/с
%T - температура в гадусах Цельсия (задается в веру программы)
%S - соленость ppt
%f - частота кГц
%pH - водородный показатель воды (в пределах: 7.6 - 8.2)

pH = 8; %водородный показатель среды изменяется в пределах 7.6 - 8.2

A1 = 8.86*10^(0.78*pH-5)*1/c_s;
A2 = 21.44*S*(1+0.025*T)/c_s;
if T<20
    A3 = 4.937*10^(-4) - T*(2.59*10^(-5) - T*(9.11*10^(-7) - 1.5*10^(-8)*T));
else
    A3 = 3.964*10^(-4) - T*(1.146*10^(-5) - T*(1.45*10^(-7) - 6.5*10^(-10)*T));
end
P2 = 1 - Z*(0.137 - 0.0062*Z);
P3 = 1 - Z*(0.0383 - 4.9*10^(-4)*Z);
f1 = 2.8*sqrt(S/35)*10^(4-1245/(273+T));
f2 = 8.17*10^(8-1990/(273+T))/(1+0.0018*(S-35));

Fk = FkHz;
%Коэффициент поглощения в дБ/км
alpha = A1*f1.*Fk.^2./(Fk.^2 + f1^2) + A2*P2*f2.*Fk.^2./(Fk.^2 + f2^2) + A3*P3.*Fk.^2;

dist = r/1000; %дистанция, км
aa = 1./db2mag(alpha * dist);


        f = 2*FkHz./Fsamp;


        
[num,den] = iirlpnorm(5,6,f,[f(1) f(length(f))], aa);
% [num,den] = iirlpnorm(5,5,f,[f(1) f(length(f))], aa);
        
PLorenzf   = filter(num, den,PLorenz);
SprottAf   = filter(num, den,SprottA);
SprottBf   = filter(num, den,SprottB);
SprottCf   = filter(num, den,SprottC);
SprottEf   = filter(num, den,SprottE);
Four_wingf = filter(num, den,Four_wing);
CHIRf = filter(num, den,CHIR);
LFM2f = filter(num, den,LFM2);
SWL2f = filter(num, den,SWL2);
cossf = filter(num, den,coss);
filt_signals = [PLorenzf; SprottAf; SprottBf; SprottCf; SprottEf; Four_wingf; CHIRf; LFM2f; SWL2f];

signals_f = [PLorenzf; SprottAf - 2;SprottBf - 4; SprottCf - 6; SprottEf - 8; Four_wingf - 10; CHIRf - 12; LFM2f - 14; SWL2f - 16; cossf - 18];
end